n = int(input())
f = [0] * (n + 1)
f[1] = 0  # 1 клетка по условию = 0
for i in range(2, n + 1):  # начинаем со второго элемента
    f[i] = f[i - 1]
    if i % 2 == 0 and f[i // 2] < f[i]:
        f[i] = f[i // 2]
    if i % 3 == 0 and f[i // 3] < f[i]:
        f[i] = f[i // 3]
    f[i] += 1
print(f[n])  # рекурсивно считаем все способы попасть в клетки из одной в другую
res = []
k = n
while n > 1:  # обратный ход
    if n % 2 == 0 and f[n // 2] == f[n] - 1:  # если поделив на 2 мы попадем в нашу клетку за один ход, то норм
        res.append(n // 2)
        n = n // 2
    elif n % 3 == 0 and f[n // 3] == f[n] - 1:  # если поделив на 3 мы попадем в нашу клетку за один ход, то норм
        res.append(n // 3)
        n = n // 3
    else:  # если нельзя попасть по другому,то мы попали из последней добавлением 1
        res.append(n - 1)
        n -= 1
print(*reversed(res), int(k))
